app/Controllers/UserController.php

SELECT *
FROM `user`
---
    public function user()
    {
        $data['users'] = $this->user->findAll();

SELECT *
FROM `user`
WHERE `user`.`id` = '9'
UPDATE `user` SET `is_aktif` = 1
WHERE `user`.`id` IN ('9')
---
    public function activate($id)
    {
        $user = $this->user->find($id);

        if (!$user) {
            return redirect()->to('/user')->with('error', 'User not found.');
        }

        // Update the `is_aktif` field of the user to activate
        $this->user->update($id, ['is_aktif' => 1]);